# Создайте несколько переменных разных
# Проверьте, к какому типу данных относятся эти переменные

a = 1
b = 1.2
c = 'abc'
d = True
print(type(a))
print(type(b))
print(type(c))
print(type(d))